#### 실행

------

> 두 개의 콘솔을 실행시킨다. 하나의 콘솔에 다음과 같이 입력하여 몽고DB를 실행시킨다.

```
> mongod
```

> 나머지 콘솔에 다음과 같이 입력한다.

```
> mongo
```

> 이제 몽고DB를 콘솔을 통해 조작할 수 있다.



##### 데이터베이스 확인 및 선택하기

> 몽고DB를 실행시키면 다음의 명령어를 통해 Database를 확인할 수 있다.

```
> show dbs
```

> 기본적으로 admin과 local이 Database로 내장되어 있는 것을 확인할 수 있다. 이제 다음의 명령어를 통해 기존에 존재하는 데이터베이스로 이동하거나, 혹은 새로운 데이터베이스를 생성하여 이동하는 것이 가능하다.

```
> use database1
```

> 아래와 같은 메시지가 뜨면 성공적으로 명령이 실행된 것이다.

```
switched to db database1
```



##### 컬렉션 확인하기

> 다음과 같은 명령어를 통해 현재 Database의 Collection들을 확인할 수 있다.

```
> show collections
```



##### 기본 명령어의 구조

> 기본 명령어의 구조는 다음과 같다.

```
> db.collection.command
```

> db는 현재 위치한 Database를 의미한다. collection에는 현재 Database내에 존재하는 collection의 이름을 명시한다. 이후에는 명령어가 위치한다.